12/data/attachments/ac01d3cfe66171ad.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>David_natural_Friend_5427_7</nif:username>
            <nif:friendToBeRequested>soap_friends_ccb6364d-4e0a-4708-8176-7131e5e87116</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>